---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelPerimeter
source: html/b384c812-a242-a773-1551-e6b68ff5eb00.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelPerimeter Property

"Perimeter": The Perimeter of Analytical Model

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelPerimeter { get; }
```